#include <stdio.h>
#include <conio.h>
#include <locale.h>
#define SIZE 10


int main()
{
	int array[SIZE] = {2, 5, 1, 8, 43, 5, 1, 1, 19, 8}; //определение массива
	int pass, i, hold; //определение: счетчика итераций, счетчика иравнений, временной €чейки 
//	int sum; //определение суммы

	setlocale(LC_ALL, "Rus");
	
/*-------------------------------------------*/	
	printf("»сходный массив \n");
	
	for (i = 1; i < SIZE; i++)
	printf("%d\n", array[i]);
/*-------------------------------------------*/	


    for (pass=1; pass<=SIZE; pass++) //цикл дл€ контрол€ числа итераций
	{
		for (i=0; i<SIZE - 1; i++) //цикл дл€ контрол€ числа сравнений на данной итерации
		{		
		//сравнить соседние элементы и обмен€ть их местами, если первый элемент больше второго
		if (array[i] > array[i+1])
		 {
			hold = array[i];
			array[i] = array[i+1];
			array[i+1] = hold;	
		 } 
		} 
	} 
	
	printf("\n");
	printf("ќтсортированый массив \n");
	for (i=0; i<SIZE; i++)
	{
		printf("%1d \n", array[i]);
	}
/*-------------------------------------------*/

	getch();
	return 0;
}






